Revit 2024 API
MechanicalUtils.ConnectDuctPlaceholdersAtCross Method (Document, Connector, Connector, Connector, Connector)
 Connects a group of placeholders that can intersect in a Cross connection.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool ConnectDuctPlaceholdersAtCross(
	Document document,
	Connector connector1,
	Connector connector2,
	Connector connector3,
	Connector connector4
)
Visual Basic
Public Shared Function ConnectDuctPlaceholdersAtCross ( _
	document As Document, _
	connector1 As Connector, _
	connector2 As Connector, _
	connector3 As Connector, _
	connector4 As Connector _
) As Boolean
Visual C++
public:
static bool ConnectDuctPlaceholdersAtCross(
	Document^ document,
	Connector^ connector1,
	Connector^ connector2,
	Connector^ connector3,
	Connector^ connector4
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document.
connector1
Type: Autodesk.Revit.DB.Connector
 The end connector of the first placeholder.
connector2
Type: Autodesk.Revit.DB.Connector
 The end connector of the second placeholder.
connector3
Type: Autodesk.Revit.DB.Connector
 The end connector of the third placeholder.
connector4
Type: Autodesk.Revit.DB.Connector
 The end connector of the fourth placeholder.
Return Value
 True if connection succeeds, false otherwise.
Remarks
 The placeholders may or may not have physical connection. However:
The ends of four connectors should intersect at same point.
The first and second placeholders should be collinear each other.
The third and fourth placeholders should be collinear each other.
The third and fourth should have intersection with first or second placeholder.
 If connection fails, the placeholders cannot be physically connected.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The owner of connector is not duct placeholder. -or- The owners of connectors belong to different types of system. -or- The curves of connector1 and connector2 are not collinear or either the connecto1 or connector2 is not connector of curve end. -or- The curves of connector3 and connector4 are not collinear or either the connecto1 or connector2 is not connector of curve end.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MechanicalUtils Class
ConnectDuctPlaceholdersAtCross Overload
Autodesk.Revit.DB.Mechanical Namespace